---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.Flow
source: html/0e0c5fa0-e95b-e420-d569-28f5bd18ebfd.htm
---
# Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.Flow Property

The actual flow of the plumbing fixture converted from dimension flow or fixture unit. Units: (gal/min).

## Syntax (C#)
```csharp
public double Flow { get; set; }
```